{
    "version": "https://jsonfeed.org/version/1",
    "title": "feed",
    "description": "",
    "home_page_url": "https://roadtransport.news",
    "feed_url": "https://roadtransport.news/feed.json",
    "user_comment": "",
    "icon": "https://roadtransport.news/media/website/Road-Transport-News-Website-Logo.png",
    "author": {
        "name": "Tristan Wiggill"
    },
    "items": [
        {
            "id": "https://roadtransport.news/cargo-heists-are-on-the-rise/",
            "url": "https://roadtransport.news/cargo-heists-are-on-the-rise/",
            "title": "Cargo Heists Are On The Rise",
            "summary": "An unprecedented surge in international freight rates of up to 700 percent is putting many companies under enormous pressure and forcing them to take drastic measures to ensure their sustainability.",
            "content_html": "<p><strong><span lang=\"EN-US\">An unprecedented surge in international freight rates of up to 700 percent is putting many companies under enormous pressure and forcing them to take drastic measures to ensure their sustainability.</span></strong></p>\n<p><span lang=\"EN-US\">In some cases, organisations are left with little choice but to find areas where they can cut costs when moving cargo. Many organisations are looking to reduce the expenses on cargo security. </span></p>\n<p><span lang=\"EN-US\">With South Africa’s soaring crime rate, this approach could have dangerous and unintended consequences. </span></p>\n<p><span lang=\"EN-US\">As a result, service provider Rhenus Logistics South Africa is constantly looking at ways to minimise threats and ensure the integrity of its customers’ shipments, whilst reducing costs.</span></p>\n<p>The number of reported truck hijackings in South Africa has escalated over the past year by an alarming 32 percent. According to Statista Research Department, 1,202 truck hijackings occurred between April 2019 and March 2020, often ending with violent attacks on drivers.</p>\n<p>With the sharp increase in online shopping as a result of COVID-19, courier vehicles are now increasingly being targeted too. Heightened activity by organised syndicates, as well as opportunistic incidents, are a reality. </p>\n<p>“Criminals have become much more brazen in their approach. The industry is now experiencing far more orchestrated heists, with groups of up to 25 robbers going after one delivery vehicle,” says Martin Taylor, Risk Manager at Rhenus Logistics South Africa, in a recent interview with television programme Carte Blanche.</p>\n<p>“It has become a strategy of ‘shoot first, steal later’, which means that cargo drivers are now more at risk than ever. Although high-value goods are most sought-after, all cargo is at risk, which means that all deliveries are vulnerable.”</p>\n<p><strong>Watch:</strong> Steals on wheels | Carte Blanche | Mnet</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/dExO_umdHrY?t=386s\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Rhenus Logistics South Africa follows state-of-the-art security protocols, including ongoing anti-hijacking training for drivers, as well as vehicle tracking and on-board video surveillance that is monitored 24/7 by highly trained control room personnel.</p>\n<p>“Cargo crime is not only going to continue, but will increase,” emphasises Taylor.</p>\n<p>“Law enforcement bodies, including the crime intelligence unit of the South African Police Service, have expanded their operations and are doing what they can, but they don’t have the capacity to fight crime by themselves.</p>\n<p>\"It needs to be a collective effort involving all stakeholders, including the public. The logistics and security industries are collaborating and sharing information and resources in efforts to combat ongoing crime.”</p>\n<p>In a financially constrained environment, it is understandable that importers will look for various ways to reduce costs and the temptation to cut on security can be great.</p>\n<p>According to Rob Stead, Chief Operating Officer at Rhenus Logistics South Africa, the cost of security in the supply chain can be as much as 11 percent of the value of goods.</p>\n<p>Stead goes on to highlight the consequences of inadequate security. “Theft results in lost sales, but also has the potential for reputational damage, should an importer‘s brand be associated with a public incident.</p>\n<p>And of course, our biggest concern is for the safety of staff members and the public that needs to be ensured at all times.” In Stead’s opinion, it is important for cargo owners to carefully consider areas of risk mitigation, to optimise these expenses.</p>\n<p>“Security awareness and agile, proactive risk management are essential. Importers needing to have their goods transported should partner with companies that have highly-developed security protocols and systems in place, such as 24/7 camera surveillance,” Stead explains.</p>\n<p><strong>Related:</strong> <a href=\"#INTERNAL_LINK#/post/null\">Webfleet Solutions, Lytx Create Video-based Solution</a></p>\n<p>“This will minimise risk and help them build more secure and resilient supply chains.” The key to successful risk management is vigilance and agility in adapting cargo handling processes.</p>\n<p>“With our many years of experience and our global footprint, we are well-equipped to stay one step ahead in the fight against crime.</p>\n<p>\"It’s an ongoing process as syndicates become more and more sophisticated – so we need to constantly evaluate developments and stay ahead of the criminals,” concludes Stead.</p>",
            "image": "https://roadtransport.news/media/posts/41/Martin-Taylor-Risk-Manager-at-Rhenus-Logistics-South-Africa.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "Logistics"
            ],
            "date_published": "2021-04-20T12:26:25+02:00",
            "date_modified": "2021-04-20T12:39:49+02:00"
        },
        {
            "id": "https://roadtransport.news/truckstore-expands-local-presence/",
            "url": "https://roadtransport.news/truckstore-expands-local-presence/",
            "title": "TruckStore Expands Local Presence ",
            "summary": "It was September 2012 when TruckStore, the used trucks &amp; buses retail outlet of Daimler Trucks &amp; Buses Southern Africa (DTBSA), officially opened its doors to buy and sell used&hellip;",
            "content_html": "<p>It was September 2012 when TruckStore, the used trucks &amp; buses retail outlet of Daimler Trucks &amp; Buses Southern Africa (DTBSA), officially opened its doors to buy and sell used vehicles and trailers of all brands, models, bodies and ages in South Africa.</p>\n<p>The retailer has since grown to become a renowned, trusted and reliable source for used commercial vehicles in Southern Africa and has notably established itself as the best performing TruckStore outlet globally.</p>\n<p>Michael Dietz, CEO of Daimler Trucks &amp; Buses Southern Africa says: “Reflecting on the TruckStore journey and seeing how this solid business model has been well adopted across Southern Africa is commendable.</p>\n<p>\"Today we are proud to be one of the industry’s leading used commercial vehicle retailers, and it is for this reason that we are taking the business to greater heights with the move to the new facility and the expansion of our footprint across South Africa”.</p>\n<p><strong>Watch:</strong> TruckStore Centurion - South Africa</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/KIvWvl-Mnp0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><span style=\"color: #e50303;\"><strong>TruckStore moves into a bigger and prominently located facility </strong></span></p>\n<p>Following a remarkable and consecutive year-on-year performance across various aspects of its business since 2012, TruckStore has made a strategic decision to relocate to a bigger facility to accommodate growing customer demands and future growth plans.</p>\n<p>Located on a 30 000sqm real estate – a stone throw away from the old facility, the new facility benefits from the excellent N1 highway visibility between the two major Gauteng airports - OR Tambo &amp; Lanseria International Airport - for the convenience of clients.</p>\n<p>Annelie van Rooyen, Head of Used Trucks says: “We are immensely excited to be opening this new facility today, taking such bold steps amidst a pandemic. Centurion remains a perfect location for our business.</p>\n<p>\"The new facility will give us an opportunity to better serve our growing customer base, provide an improved customer experience and increase service capacity. This move represents a milestone for TruckStore and will certainly create opportunities for growth and strengthen the brand’s position in Southern Africa”.</p>\n<p>The facility has ample parking for large vehicles and features a 1, 200sqm showroom and office space with great exposure and easy access.</p>\n<p>Included are six open sales offices overlooking great views of the highway and allowing for flexibility and transparency to processes. The new offices make every customer visit special, with a welcoming reception.</p>\n<p>At the rear of the facility is an approximately 3 000sqm fully-equipped and dedicated Mercedes-Benz approved workshop and parts centre for Mercedes-Benz TruckParts and Fuso Value Parts.</p>\n<p>Included also are ten dedicated bus service bays. The workshop also provides capacity for non-Daimler brands as well as servicing of trailers. This is an extension of value added services and forms part of TruckStore’s overall strategy of being a one-stop shop to its customers.</p>\n<p><span style=\"color: #e50303;\"><strong>TruckStore further expands its footprint across South Africa </strong></span></p>\n<p>TruckStore is pleased to announce that it will be expanding its presence, making TruckStore products and services available across all major cities in South Africa.</p>\n<p>This is a strategic decision which focuses on bringing sales activities closer to the customers by fully leveraging the existing Daimler Trucks &amp; Buses dealer network, ensuring dedication and the best sales experience going forward.</p>\n<p>There is a clear strategy put in place to integrate fully into the existing authorized DTBSA dealer network.</p>\n<p>Van Rooyen further adds: “We are proud of this new business model as it reaffirms our commitment to continuously support our customers irrespective of where they are. We are taking an important step in our business as we see capacity for sales growth, not only for TruckStore, but for our dealer partners as well.</p>\n<p>\"We want to provide the same level of sales and after-sales service that a customer would receive when purchasing a new vehicle”.</p>\n<p>Looking ahead, TruckStore has a clear strategy for Southern Africa mapped out and at the core of this is customers, bringing in high-quality, competitively priced, refurbished and certified used commercial vehicles to the market to meet the ever-changing customer demands.</p>\n<p><strong>Now read:</strong> <a href=\"https://roadtransport.news/jac-motors-continues-to-grow/\">JAC Motors Continues To Grow</a></p>",
            "image": "https://roadtransport.news/media/posts/40/TruckStore-Expands-2.jpeg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-04-19T11:58:28+02:00",
            "date_modified": "2021-04-19T12:29:27+02:00"
        },
        {
            "id": "https://roadtransport.news/faw-leads-hcv-pack/",
            "url": "https://roadtransport.news/faw-leads-hcv-pack/",
            "title": "FAW Leads HCV Pack",
            "summary": "FAW Trucks achieved a significant milestone in its local history by taking the top spot in the Heavy Commercial Vehicle (HCV) segment of the local market for the first time&hellip;",
            "content_html": "<p><strong>FAW Trucks achieved a significant milestone in its local history by taking the top spot in the Heavy Commercial Vehicle (HCV) segment of the local market for the first time in January this year. </strong></p>\n<p>With 50 unit sales recorded for the first month of 2021, FAW Trucks had a fair lead over second-placed Hino, with 20 sales.</p>\n<p>This already impressive performance was surpassed in February, when FAW Trucks sold a significant 80 HCV units, well ahead of its closest rival, Hino (58) and third-placed Isuzu (52).</p>\n<p>“Since first entering the local market in 1994, it has been our mission to provide South African buyers with products of high quality that are not only well suited to local conditions, but also boast high levels of safety, convenience and comfort,\" says Jianyu Hao, CEO of FAW South Africa.</p>\n<p>\"We have managed to combine this with competitive pricing, low running costs and excellent aftersales service. Our remarkable sales success in January and February is proof that we are doing something right as more and more buyers are opting for our trucks.”</p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/jac-workhorse-finds-smb-favour/\">JAC X200 Finds SMB Favour</a></p>\n<p>FAW’s sales in the HCV segment is driven by two models, the 8.140FL and the 15.180FL.</p>\n<p>Both are ideally suited to customers in the farming and agriculture sector and have also found favour with small contractors and businesses, as well as fleet operators such as courier companies.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://roadtransport.news/media/posts/39/FAW-8.140FL-5-Ton-1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/39/responsive/FAW-8.140FL-5-Ton-1-xs.jpg 300w ,https://roadtransport.news/media/posts/39/responsive/FAW-8.140FL-5-Ton-1-sm.jpg 480w ,https://roadtransport.news/media/posts/39/responsive/FAW-8.140FL-5-Ton-1-md.jpg 768w ,https://roadtransport.news/media/posts/39/responsive/FAW-8.140FL-5-Ton-1-lg.jpg 1024w ,https://roadtransport.news/media/posts/39/responsive/FAW-8.140FL-5-Ton-1-xl.jpg 1360w ,https://roadtransport.news/media/posts/39/responsive/FAW-8.140FL-5-Ton-1-2xl.jpg 1600w\"  alt=\"FAW 8.140FL\" width=\"800\" height=\"515\"></figure>\n<p>The 8.140FL freight carrier/tipper was first introduced in South Africa in 2015 and has a body and payload allowance of 6 tonnes. Providing seating for a driver and two passengers, it features a spacious and ergonomically designed cab, while air-conditioning and a radio with MP3 and USB functionality are standard.</p>\n<p>Fitted with a Euro 3 Cummins ISF 3,8-litre engine, the 8.140FL delivers a healthy 450 Nm of torque between 1 200 and 2 200 r/min, while a solid output of 105 kW is on tap at 2 600 r/min. Additional features include a full air dual circuit WABCO braking system with ABS.</p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/isuzu-cummins-power-ahead/\">Isuzu, Cummins Power Ahead</a></p>\n<p>The 15.180FL has a spacious, ergonomically designed semi-sleeper cab with a 9.8-tonne body and payload allowance.</p>\n<p>Occupant comfort is a priority in FAW Trucks and therefore standard features include air-conditioning and a radio with MP3 and USB capability.</p>\n<p>The engine is a Euro 2-compliant 6 557 cc, six-cylinder, in-line turbocharged unit that delivers 132 kW at 2 300 r/min and has 650 Nm of peak torque on tap between 1 400 and 1 600 r/min. Like the 8.140FL, it also has a full air dual circuit WABCO braking system with ABS.</p>\n<p><strong>Watch:</strong> FAW 15 180FL</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/NPDFa459ffg\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>In keeping with market trends and in response to customer requirements, FAW Trucks will upgrade and expand its range of vehicles during the course of 2021.</p>\n<p>To ensure that the product offering remains fresh, while at the same time catering to changing demands within the HCV segment, additional transmission options and a new derivative are on the cards .</p>\n<p>“The current HCV range carries all the hallmarks that FAW products are renowned for, namely strength, reliability, ease of operation, and most importantly, delivering on the promise of a ‘truck built in South Africa, for Africa’,” Hao explains.</p>\n<p>“The planned upgrades to and expansion of the range will once again set the bar even higher and should bolster our sales performance even further as we head into the second half of the year.</p>\n<p>All FAW heavy commercial Trucks carry a two-year/unlimited kilometre warranty.</p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/tata-international-africa-introduces-five-year-warranty/\">Tata International Africa Introduces Five-year Warranty</a></p>\n<p>\"With almost 40 local representative outlets across South Africa, Namibia, and Botswana, Zambia, Zimbabwe and Mozambique, backed up by a dedicated national parts distribution facility in Spartan, we remain fully committed to offering our customers excellent aftersales service.</p>\n<p>\"Good products and good service are what drive good sales figures,” concludes Hao.</p>",
            "image": "https://roadtransport.news/media/posts/39/FAW-HCV.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-04-09T08:19:40+02:00",
            "date_modified": "2021-04-09T08:43:13+02:00"
        },
        {
            "id": "https://roadtransport.news/jac-workhorse-finds-smb-favour/",
            "url": "https://roadtransport.news/jac-workhorse-finds-smb-favour/",
            "title": "JAC X200 Finds SMB Favour",
            "summary": "Long before the Covid-19 pandemic changed the business environment as we know it, JAC Motors' X200 forward-cab light commercial vehicle (LCV) was already a popular choice among business owners worldwide.",
            "content_html": "<p><strong>Long before the Covid-19 pandemic changed the business environment as we know it, JAC Motors' X200 forward-cab light commercial vehicle (LCV) was already a popular choice among business owners worldwide.</strong></p>\n<p>With Covid-19 fuelling the online industry and demand for delivery services, entrepreneurs involved in distributing products are constantly searching for more affordable and effective fleet solutions to deliver on their customers' expectations.</p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/telematics-supports-e-commerce-growth/\">Telematics Supports E-commerce Growth</a></p>\n<p>Reliability, low running cost and versatility are critical elements in managing any fleet, and it is in these departments where the X200 impresses its owners and drivers.</p>\n<p>The X200 was developed to excel in the harshest working conditions. Although it is a versatile workhorse, it comes standard with features such as air-conditioning and crumple zones to create a safe and comfortable work environment for the driver and passengers.</p>\n<p>Companies supplying services like catering hire, furniture deliveries, truck hire, garden services, contractors, electricians, plumbers and many other types of small businesses are using the versatile X200.</p>\n<p>\"Currently, everyone is trying to find ways to do more with less due to economic pressures,\" says Karl-Heinz Göbel, CEO of JAC Motors South Africa.</p>\n<p>\"Our affordable X200 bakkie is the best workhorse choice in the local market, as it outclasses direct competitors in the price, performance, load configuration and comfort categories.\"</p>\n<p><span style=\"color: #e50303;\"><strong>Compact and manoeuvrable workhorse to go where big trucks cannot</strong></span></p>\n<p>It is essential in the commercial vehicle sector that an LCV's design caters for various customer groups. A forward-cab design's main benefit is the increased load box size with a much larger load volume. A forward-cab design is more practical than a standard bakkie, making these rugged workhorses ideal for business and industrial use.</p>\n<p>The X200's compact size and minimum turning radius of 5.4 metres ensure easy manoeuvrability in places where larger trucks cannot navigate. The optimal ride height and ultra-flat low deck of the X200, with its dropsides, make loading and unloading easy and fast.</p>\n<p><strong>Watch:</strong> JAC X200 - A perfect mini-truck for your business</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/jBAn4GUr9kA\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>A forward-cab design also incorporates other advantages that both drivers and fleet owners appreciate, such as the easy entrance and exit for drivers and crew in many load-stop-and-drop situations.</p>\n<p><span style=\"color: #e50303;\"><strong>Reliable 2.8-litre turbo-diesel engine for harsh working conditions</strong></span></p>\n<p>The X200 supports a proven 2.8-litre four-cylinder turbo-diesel engine mounted under the front seats. This reliable engine produces 80 kW at 3 600 r/min and 240 Nm of torque between 1 800 and 2 000 r/min.</p>\n<p>A trademark of the X200's powertrain design is fuel economy. The power is distributed via a 5-speed transmission to the rear wheels.</p>\n<p>The maximum torque available at low rpm allows drivers to minimise gear changes and reduce fuel usage. The average fuel consumption of the X200 is 9.5 ℓ/100 km (combined cycle).</p>\n<p>\"The X200 boasts the ideal engine capacity for our country's demanding conditions. The durable 2.8-litre turbo-diesel engine produces more than 30% power than its direct competitors, resulting in outstanding functionality and everyday utility in urban and regional operations,\" says Göbel.</p>\n<p><span style=\"color: #e50303;\"><strong>Robust chassis design for demanding working conditions</strong></span></p>\n<p>The X200 supports JAC Motors' new chassis stamping and welding treatment process, developed for the heavy-duty ladder-frame chassis used in their N-Series truck range. The main benefit of a solid ladder-frame chassis is the optimum axle weight distribution that enhances safety.</p>\n<p>The X200's double-wishbone independent front suspension and robust ladder-frame chassis design allow for excellent manoeuvrability and solid handling regardless of how much payload it is carrying.</p>\n<p>Large disc brakes in front supported by drum brakes at the back and a Load Sensing Proportioning Valve (LSPV) deliver excellent stopping power.</p>\n<p>The hydraulic assisted power steering provides excellent handling, optimised manoeuvrability and safe driving characteristics in all load states and on any road surface.</p>\n<p><span style=\"color: #e50303;\"><strong>Large payload to easily transport heavy loads</strong></span></p>\n<p>With a maximum permitted payload of 1 500 kg, a large load area of 4 595 mm², the X200 offers practical solutions for everyday use that will meet customer expectations for any transport task at hand.</p>\n<p>The length of the X200's load box almost measures 2.8 metres. Space is optimally designed for working conditions with a lower deck height of just 785 mm. With standard dropside configuration, the X200 is ready to meet the modern-day demands of cargo transport.</p>\n<p>The maximum use of axle capacities for ideal payload weight distribution ensures optimal manoeuvrability in heavy urban traffic and on open roads. The X200 can tow a braked trailer of up to 1 250 kg.</p>\n<p>\"The no-nonsense work attitude of the X200 explains why it is such a favourite with business owners worldwide. Its powerful engine, balanced transmission and excellent payload creates confidence whatever or wherever the haul is,\" adds Göbel.</p>\n<p><span style=\"color: #e50303;\"><strong>An ergonomic driver's workplace</strong></span></p>\n<p>The X200 offers an elevated driving position. The results are that the driver can see and judge traffic better on the open roads, and it further improves visibility when parking at load bays.</p>\n<p>Front- and rear crumple zones, side-impact protection beams, height-adjustable headlamps and an immobiliser further add to occupants' safety.</p>\n<p>Remote-controlled central locking with motion-lock at 40 km/h and an engine that cannot ignite when the clutch is not engaged further contribute to the safety credentials of the X200.</p>\n<p>An air-conditioned cab with comfortable cloth seats with headrests, and a height-adjustable steering wheel, make for pleasant travelling for both the driver and passengers.</p>\n<p>The centre seat's backrest folds down, offering ample stowing space. The X200 comes standard with a Radio/CD/MP3 player and speakers fitted in the front doors.</p>\n<p><span style=\"color: #e50303;\"><strong>Model line-up and pricing</strong></span></p>\n<p>With the most competitive pricing in its class, the X200 offers excellent value for money to get your business going.</p>\n<p>Priced from R284 900, the X200 comes standard with a five-year/150 000-kilometre manufacturer warranty, including a five-year/60 000-kilometre service plan. Service intervals are scheduled for every 10 000 km.</p>\n<p>The JAC X200 2.8-litre TDi 1.5-tonne range comprises three derivatives:</p>\n<ul>\n<li>X200 Chassis Cab – R284 900</li>\n<li>X200 Dropside – R294 900</li>\n<li>X200 Tipper – R324 900</li>\n</ul>\n<p>The X200 is also available in double-cab configuration and retails at R304 900. Fitted with the same 2.8-litre TDi engine and a payload of 1.3-tonne, the double-cab is especially popular with operators who need to transport more than three workers.</p>\n<p>The double-cab can transport six people inside the cab. According to the local traffic regulations, it is illegal to transport people on the back of a bakkie on public roads.</p>\n<p>\"Our reliable and versatile X200 range meets our ever-increasing customer expectations and tick all the right boxes to be the star performer in any transport fleet,\" concludes Göbel.</p>\n<p><strong>Now Read: <a href=\"https://roadtransport.news/jac-motors-continues-to-grow/\">JAC Motors Continues To Grow</a></strong></p>",
            "image": "https://roadtransport.news/media/posts/38/JAC-X200.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-04-08T16:15:18+02:00",
            "date_modified": "2021-04-08T16:23:09+02:00"
        },
        {
            "id": "https://roadtransport.news/telematics-supports-e-commerce-growth/",
            "url": "https://roadtransport.news/telematics-supports-e-commerce-growth/",
            "title": "Telematics Supports E-commerce Growth",
            "summary": "If ever there was a time for the e-commerce sector to adopt telematics technology, it would be now. COVID-19 has disrupted the retail landscape, with more South Africans now choosing&hellip;",
            "content_html": "<p class=\"paragraph\"><strong><span class=\"normaltextrun\"><span lang=\"EN-US\">If ever there was a time for the e-commerce sector to adopt telematics technology, it would be now.</span></span></strong></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">COVID-19 has disrupted the retail landscape, with more South Africans now choosing e-commerce as their preferred shopping channel over traditional brick-and-mortar stores. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">According to a Mastercard study, as much as </span></span><a href=\"https://newsroom.mastercard.com/mea/press-releases/68-of-sa-consumers-are-shopping-more-online-since-the-start-of-pandemic-reveals-mastercard-study/#:~:text=Press%20Releases-,68%25%20of%20SA%20Consumers%20are%20Shopping%20More%20Online%20Since%20the,of%20Pandemic%2C%20Reveals%20Mastercard%20Study&amp;text=Johannesburg%2C%20South%20Africa%20%E2%80%93%2026%20November,of%20the%20COVID%2019%20pandemic.\" target=\"_blank\" rel=\"noopener\"><span class=\"normaltextrun\"><span lang=\"EN-US\">68% of South African consumers said they are shopping more online</span></span></a><span class=\"normaltextrun\"><span lang=\"EN-US\"> since the onset of the pandemic. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">More online shopping means that there are more deliveries to be made, and the logistics industry has had to scale operations to meet the growing demand. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">The various levels of lockdown, COVID-19 regulations and people working from home have created a greater reliance on home deliveries, with the industry now finding itself at an all-time peak, and with more vehicles on the road than ever before.</span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span style=\"color: #e50303;\"><span class=\"normaltextrun\"><strong><span lang=\"EN-US\">Increased demand has created new challenges for courier companies </span></strong></span><span class=\"eop\"> </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Whether it’s an established company with a massive fleet or a startup business with only two vehicles, courier companies now need to manage their deliveries as efficiently, safely, and cost-effectively as possible. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">That’s because increased demand for e-commerce has created an even greater expectation by customers to consistently receive their items when, how, and where they want – placing pressure on courier companies and drivers to meet this demand. </span></span><span class=\"eop\"> </span></p>\n<p><strong>Watch:</strong> Unpacking E-commerce in South Africa</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/oy9Xrqfww0I\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">At the same time, businesses also need to ensure drivers follow COVID-19 regulations while out on deliveries, especially considering that they're coming into contact with more customers than ever before. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Unfortunately, adding to this pressure is the increased need for driver and cargo safety. While the immense growth in online shopping has boosted the e-commerce sector, it’s also resulted in more criminals shifting their focus to courier vehicles, targeting goods in transit. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">There's been a massive spike in hijackings over the last year, with the current trend involving criminals targeting courier deliveries to steal the cargo instead of the vehicle itself. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Incidents of armed courier vehicle robberies have been on the rise, with one incident taking place as recently as February this year, </span></span><a href=\"https://www.news24.com/news24/video/southafrica/news/watch-armed-men-fire-shots-at-courier-van-delivering-cellphones-in-pretoria-20210204\" target=\"_blank\" rel=\"noopener\"><span class=\"normaltextrun\"><span lang=\"EN-US\">where armed robbers fired shots at a courier van delivering cellphones in Pretoria</span></span></a><span class=\"normaltextrun\"><span lang=\"EN-US\">. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span style=\"color: #e50303;\"><span class=\"normaltextrun\"><strong><span lang=\"EN-US\">Telematics solutions drive safety and efficiency in the e-commerce sector </span></strong></span><span class=\"eop\"> </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Telematics technology significantly improves operational efficiencies, increases customer satisfaction, and promotes safety for drivers and packages. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Solutions like </span></span><a href=\"https://www.webfleet.com/en_za/webfleet/industries/courier-services/\" target=\"_blank\" rel=\"noopener\"><span class=\"normaltextrun\"><span lang=\"EN-US\">WEBFLEET</span></span></a><span class=\"normaltextrun\"><span lang=\"EN-US\"> are now an essential business tool for courier companies, equipping fleet managers with the resources to respond effectively to the demand for home delivery and growing customer expectations. </span></span><span class=\"eop\"> </span></p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/webfleet-solutions-lytx/\">Webfleet Solutions, Lytx Create Video-based tracking solution</a></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">These solutions enable fleet managers and the end customer to gain visibility of a vehicle's location in real-time. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Fleet managers can also establish the optimal route for drivers, add new jobs to the schedule or implement corrective action to re-route a driver to avoid congestion or accidents. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Better driving practices reduce vehicle maintenance requirements, and the system can alert vehicle owners about scheduled services, so that vehicle down-time can be planned around. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">These both contribute to lower operating costs and maximised profits. </span></span><span class=\"normaltextrun\"><span lang=\"EN-US\">Using this technology, brands can provide full transparency to customers, who aren't left wondering when their package will arrive. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Telematics data can also produce detailed fuel efficiency reports by monitoring drivers' habits, including idling, revving, speeding, and excessive braking. This data then helps fleet managers identify improvement areas when training drivers to drive more efficiently. </span></span><span class=\"eop\"> </span></p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/insurance-and-driver-training-intertwined/\">Insurance and driver training intertwined</a></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Easy-to-use Software as a Service (SaaS) telematics technology fits any commercial vehicle for advanced vehicle tracking. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">That means fleet managers gain total visibility of everything that happens on the road, including vehicle usage. They can also support drivers in the field with the right tools to keep them safe and make their jobs easier. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">The technology can also facilitate contactless deliveries by enabling companies to go paperless and instead use electronic invoicing. That way, drivers can maintain a safe distance when out in the field, and fleet managers can ensure customers receive their cargo on schedule. </span></span><span class=\"eop\"> </span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-US\">Telematics software can transform the e-commerce supply chain and customer experience, enabling the sector to reassure customers that they're receiving a reliable, safe, and cost-effective service. </span></span></p>\n<p><strong>Now read:</strong> <a href=\"https://roadtransport.news/tata-parts-online/\">Tata, Daewoo Truck Parts Now Online</a></p>",
            "image": "https://roadtransport.news/media/posts/37/Webfleet-Solutions.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Telematics",
                   "Opinion"
            ],
            "date_published": "2021-04-08T10:31:59+02:00",
            "date_modified": "2021-04-08T10:53:46+02:00"
        },
        {
            "id": "https://roadtransport.news/hino-connect-adds-further-value/",
            "url": "https://roadtransport.news/hino-connect-adds-further-value/",
            "title": "HINO-CONNECT Adds Further Value",
            "summary": "HINO-CONNECT, a full fleet management system, will be installed as a standard fitment on the full range of trucks offered by Hino South Africa from April 2021. This includes the&hellip;",
            "content_html": "<p><strong>HINO-CONNECT, a full fleet management system, will be installed as a standard fitment on the full range of trucks offered by Hino South Africa from April 2021. </strong></p>\n<p>This includes the Dyna, 300, 500 and 700 models and is a joint venture with Cartrack, an international mobility solutions provider.</p>\n<p>“This comprehensive telematics solution includes a three-year subscription from date of fitment and will be an important, additional tool to ensure we continue to provide the highest levels of customer satisfaction,” explained Ernie Trautmann, Vice President of Hino South Africa.</p>\n<p>“Hino’s Total Support strategy, which builds strong relationships and trust with all stakeholders, and has been the backbone of our success here in South Africa for many years, will benefit hugely from the data this system will now be able to provide to our customers, Hino South Africa and Hino Japan.”</p>\n<p> HINO-CONNECT will provide three sets of data:</p>\n<ul>\n<li>Positional data for tracking and recovery as well as distances travelled.</li>\n<li>Vehicle performance data including fuel consumption, oil and water temperatures and speed.</li>\n<li>Diagnostic Trouble Code (DTC) fault reporting direct to Hino SA and the dealer concerned, who will know what is wrong before getting to the vehicle, thereby enabling quicker reaction time to get the vehicle back on the road.</li>\n</ul>\n<p>All data is stored for five years, with the last six months’ data available immediately.</p>\n<p>“Over the years Hino has increased the number of value-added products offered to its customers, ranging from extended service intervals to competitive service and maintenance plans, warranties on replacement parts fitted by franchise dealers.</p>\n<p>And now HINO-CONNECT will open the way to us considering a buyback and preowned truck programme,” added Trautmann.</p>\n<p>“HINO-CONNECT means we can monitor a truck’s operating life before preparing it for resale, and in view of the high resale value of a Hino truck we will be able to offer favourable buyback rates.</p>\n<p>“Hino’s ultimate objective is to offer a total logistics partnership for our customers, where the truck is the tool in an integrated solution to meet an operator’s specific requirements.”</p>\n<p>Harry Louw, Cartrack’s CEO, says that his company is the only mobility solutions provider in South Africa which has everything it offers in-house.</p>\n<p>This includes installation and after sales service through over 600 mobile workshops, field training, specialist onboarding teams, its own exclusive stolen vehicle recovery infrastructure, and the engineering skills to access and deliver the data required by Hino.</p>\n<p>“Our sophisticated in-vehicle technology has proven its robustness and reliability in over 1.3 million vehicles across 23 countries. </p>\n<p>\"Our Software-as-a-Service platform is developed in-house and meets the requirements of tens of thousands of commercial customers around the world.  It is highly scalable, and we are able to quickly respond to customer requirements for additional features,” explained Louw.</p>\n<p>“Software development is also ongoing as part of our continuous drive to deliver cutting edge mobility solutions, which is now extending to the use of artificial intelligence to deliver richer information to our customers.</p>\n<p>\"Service delivery is a core value and customer service is a lifestyle for all the Cartrack team members.”</p>\n<p>“Hino South Africa continues to fare very well in the quarterly Competitive Customer Experience ratings, and we are sure that HINO-CONNECT will be a further added value offering that our customers will appreciate.</p>\n<p>\"We have taken our time to launch the HINO-CONNECT standard telematics system as we wanted to ensure we would have the right product and the right partner when the system was implemented.</p>\n<p>\"That time is now,” concludes Trautmann.</p>\n<p><strong>Now read:</strong> <a href=\"https://roadtransport.news/imperial-enters-strategic-partnership-with-mix-telematics/\">Imperial Deepens MiX Telematics Ties</a></p>",
            "image": "https://roadtransport.news/media/posts/36/farmers-in-need.2.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Telematics",
                   "Press Release"
            ],
            "date_published": "2021-04-05T09:13:45+02:00",
            "date_modified": "2021-04-05T09:18:53+02:00"
        },
        {
            "id": "https://roadtransport.news/isuzu-cummins-power-ahead/",
            "url": "https://roadtransport.news/isuzu-cummins-power-ahead/",
            "title": "Isuzu, Cummins Power Ahead ",
            "summary": "Cummins Inc. and Isuzu Motors Limited have announced agreements for a global mid-range diesel powertrain and an advanced engineering collaboration. The move marks another step forward in the Isuzu Cummins&hellip;",
            "content_html": "<p><strong>Cummins Inc. and Isuzu Motors Limited have announced agreements for a global mid-range diesel powertrain and an advanced engineering collaboration. </strong></p>\n<p>The move marks another step forward in the Isuzu Cummins Powertrain Partnership (ICPP).</p>\n<p>The partnership, formed in May 2019, formalised a business structure for the two companies to evaluate and carry out opportunities to jointly develop and bring new diesel and alternate powertrains to global markets. </p>\n<p>“We are pleased to take another step forward in the partnership by powering Isuzu vehicles with Cummins engines in global markets,” said Tom Linebarger, Chairman and CEO, Cummins Inc.<br><br>“Cummins and Isuzu have been working on our partnership based on strong trust in each other. I am pleased to announce today our first step in this collaboration.\"</p>\n<p>\"We will accelerate holistic collaboration in joint research for advanced engineering capabilities and further developments in advanced diesel technologies to deliver optimum trucks and powertrains to customers all over the world,” said Masanori Katayama, President and Representative Director, Isuzu Motors Limited.</p>\n<p><strong>Watch:</strong> Cummins Performance Series B6.7 Engine</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/lA4wkrZgW1A\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><br>Under this global mid-range diesel collaboration agreement, Cummins will provide Isuzu mid-range B6.7 diesel platforms for use in medium-size trucks to meet global customer needs.</p>\n<p>Cummins and Isuzu will closely work together to integrate the engine with Isuzu’s chassis and to meet Japan’s emission regulations.</p>\n<p>Isuzu chassis powered by Cummins B6.7 diesel platform engines will be introduced in North America in 2021, and in Japan, Southeast Asia and other regions at a later date.<br><br>This collaboration will allow both companies to best serve end user needs across the globe while optimising their respective investments in both diesel and emerging technologies.</p>\n<p>The engines for trucks built in Japan will be assembled at Isuzu’s plant located in Tochigi, Japan.<br><br>Isuzu and Cummins also entered into an Advanced Technology Agreement to conduct joint research for various powertrain technologies using the companies’ respective advanced engineering capabilities.</p>\n<p>Both companies are committed to further enhance efficiency and emissions capability of their advanced diesel products.</p>\n<p>As part of the path to carbon neutral, Isuzu and Cummins have recently expanded the partnership discussions to include new power sources, including electrical powertrain technologies.<br><br>Cummins and Isuzu continue to innovate and advance the future power sources for commercial vehicles in terms of power, quality, reliability, emissions and fuel efficiency.</p>\n<p>Together, the companies believe there may be further opportunities to benefit from each other’s unique strengths by harnessing each other’s products and technology to drive global growth.</p>\n<p><strong>Now read:</strong> <a href=\"https://roadtransport.news/tata-parts-online/\">Tata, Daewoo Truck Parts Now Online</a></p>",
            "image": "https://roadtransport.news/media/posts/35/Isuzu-with-Cherry-Picker.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-04-05T08:48:19+02:00",
            "date_modified": "2021-04-05T09:04:18+02:00"
        },
        {
            "id": "https://roadtransport.news/new-gen-scanias-slash-tco/",
            "url": "https://roadtransport.news/new-gen-scanias-slash-tco/",
            "title": "New Gen Scania&#x27;s Slash TCO",
            "summary": "South Africa’s transport industry is adjusting to a new normal as the effects of the COVID-19 restrictions have changed traditional supply chain models, customer behaviour, government infrastructure funding and long-established&hellip;",
            "content_html": "<p><strong>South Africa’s transport industry is adjusting to a new normal as the effects of the COVID-19 restrictions have changed traditional supply chain models, customer behaviour, government infrastructure funding and long-established business models.</strong></p>\n<p>As the economy contracts, transport industry operators face multiple business challenges, including rising operating costs, increased fuel prices, decreasing revenues and tighter margins.</p>\n<p>“Scania has always been at the forefront of setting new standards in sustainable logistics solutions,” says Nomonde Kweyi, General Manager, Marketing &amp; Communications, Scania Southern Africa.</p>\n<p>“Improving the quality of our products while continuously improving the flows across every part of our supply chain, eliminates waste and allows us to challenge operating costs.”</p>\n<p>Scania’s New Truck Generation is setting new benchmarks in the total cost of ownership, providing customers with sustainable cost-efficiencies, and securing them a competitive advantage in their industries.</p>\n<p>State-of-the-art technological leadership is behind Scania’s latest sustainable operating breakthrough.</p>\n<p>Vehicle data recorded from multiple Scania trucks, in daily operation, using multiple drivers, yielded an average 10% fuel saving across the New Generation truck range.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://roadtransport.news/media/posts/34//Scania-truck-in-arid-conditions.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/34//responsive/Scania-truck-in-arid-conditions-xs.jpg 300w ,https://roadtransport.news/media/posts/34//responsive/Scania-truck-in-arid-conditions-sm.jpg 480w ,https://roadtransport.news/media/posts/34//responsive/Scania-truck-in-arid-conditions-md.jpg 768w ,https://roadtransport.news/media/posts/34//responsive/Scania-truck-in-arid-conditions-lg.jpg 1024w ,https://roadtransport.news/media/posts/34//responsive/Scania-truck-in-arid-conditions-xl.jpg 1360w ,https://roadtransport.news/media/posts/34//responsive/Scania-truck-in-arid-conditions-2xl.jpg 1600w\"  alt=\"\" width=\"800\" height=\"534\"></figure>\n<p>“Every Scania we make is equipped with smart technology, advanced sensors and wireless connectivity,\" explains Mark Erasmus, General Manager Sales, Scania Southern Africa. </p>\n<p>\"We have thousands of constantly connected vehicles providing the data needed to make informed cost savings decisions,” he adds.</p>\n<p>This proven 10% fuel saving, compared to the Scania PGR range, makes the Scania New Generation the most fuel-efficient truck in South Africa.</p>\n<p>“Fuel costs can equate to over a third of operators’ total operating costs,” says Erasmus, “Any improvement in fuel efficiency can provide drastic savings.”</p>\n<p>But Scania isn’t resting on their laurels.</p>\n<p>“The highest recorded fuel savings in the market provides our customers with the cost-savings needed to offset maintenance costs.\"</p>\n<p>\"By using the fuel savings, our customers can pay zero maintenance costs,” explains Erasmus.</p>\n<p>Maintaining a truck at zero cost, especially when calculated across a fleet, has the potential to remove significant expenditure from operators’ total running costs, boosting profitability and significantly improving their ability to compete in a highly competitive market.</p>\n<p><strong>Watch: </strong>Meet Scania’s next generation of trucks</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/fsN_vjVE09I\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>“Across industries, including freight and logistics, construction, mining and agriculture, we know that maintenance costs absorb much-needed revenue and profit.\"</p>\n<p>\"The New Truck Generation has the potential to pay for its own maintenance,” says Erasmus.</p>\n<p>It’s total cost of ownership redefined, and Scania South Africa sees it as a game-changer that will help their customers find a sustainable revenue increase while their competitors continue to struggle with high operating costs.</p>\n<p>“As challenging economic realities bite, Scania’s sustainable cost-efficiencies are driving our customers business ambitions and delivering increased profitability, that is helping them achieve otherwise elusive business growth,” concludes Erasmus.</p>\n<p><strong>Now read:</strong> <a href=\"https://roadtransport.news/babcock-updates-daf-trucks-range/\">Babcock Updates DAF Trucks Range</a></p>",
            "image": "https://roadtransport.news/media/posts/34/Scania-truck.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-03-24T16:58:44+02:00",
            "date_modified": "2021-03-24T17:05:56+02:00"
        },
        {
            "id": "https://roadtransport.news/volvo-trucks-responds-to-sos/",
            "url": "https://roadtransport.news/volvo-trucks-responds-to-sos/",
            "title": "Volvo Trucks Responds To SOS",
            "summary": "Water is a scarce and precious commodity, and access to reliable and clean source is a basic human right. Unfortunately, many communities around South Africa must do without this essential&hellip;",
            "content_html": "<p class=\"p1\"><strong>Water is a scarce and precious commodity, and access to reliable and clean source is a basic human right.<span class=\"Apple-converted-space\">  </span></strong></p>\n<p>Unfortunately, many communities around South Africa must do without this essential resource.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\">For this reason, Volvo Trucks South Africa has donated two FMX trucks to the SOS Water on Wheels project in the Western Cape, to bring water and sanitation right to communities’ doorsteps.</p>\n<p class=\"p3\">SOS NPO supports under-privileged communities and schools within the water and sanitation hygiene space (WASH).  </p>\n<p>They collaborate with community stakeholders, government, and businesses to provide additional water, sanitation and hygiene sources and solutions, as well as providing non-portable water, transportation, and infrastructure.</p>\n<p class=\"p4\"><strong>Related: </strong><a href=\"https://roadtransport.news/motus-isuzu-supports-farmers/\">Motus Isuzu Supports Farmers</a></p>\n<p class=\"p3\">It addresses sanitation, hygiene, climate change and education around these issues.</p>\n<p>We also focus on economic female empowerment and create local job opportunities wherever possible within our on-site project teams. <span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p3\">For this reason, two female drivers have been appointed by SOS NPO to operate the vehicles, and they will undergo an extensive four-month driver training through Volvo Trucks’ Iron Women programme.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p1\">Volvo Trucks have been involved with the SOS project since 2018, and the two trucks transport water, food and materials needed to schools and communities around the Western Cape.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://roadtransport.news/media/posts/33//Volvo-Trucks-Water-Initiative.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/33//responsive/Volvo-Trucks-Water-Initiative-xs.jpg 300w ,https://roadtransport.news/media/posts/33//responsive/Volvo-Trucks-Water-Initiative-sm.jpg 480w ,https://roadtransport.news/media/posts/33//responsive/Volvo-Trucks-Water-Initiative-md.jpg 768w ,https://roadtransport.news/media/posts/33//responsive/Volvo-Trucks-Water-Initiative-lg.jpg 1024w ,https://roadtransport.news/media/posts/33//responsive/Volvo-Trucks-Water-Initiative-xl.jpg 1360w ,https://roadtransport.news/media/posts/33//responsive/Volvo-Trucks-Water-Initiative-2xl.jpg 1600w\"  alt=\"\" width=\"800\" height=\"650\">\n<figcaption >From left to right: Nandipha Bhuyan (Driver), Onica Ndlovu (Used Trucks Director: Volvo Trucks South Africa), Marcus Hörberg, (VP: Volvo Group Southern Africa), Shelley Humphreys (Executive Director: SOS NPO), Valentia Hobbs (Director Marketing and Corporate Affairs: Volvo Group Southern Africa) and Sinazo Mcetywa (Driver)</figcaption>\n</figure>\n<p>Since the start of the COVID-19 pandemic, the project has expanded to provide essential sanitation stations to curb the spread of the virus in areas where it was most needed.</p>\n<p class=\"p1\">“We are very humbled that, with the support of Volvo Group global, we are now able to donate these vehicles to SOS,\" says Marcus Hörberg, vice president of Volvo Group Southern Africa.</p>\n<p>\"We trust that reliable transport will continue to make a tangible difference in the efforts of this very worthy organisation.” </p>\n<p>“At Volvo Trucks we believe that transport can drive prosperity, and we feel grateful that our trucks can impact the lives of many in this way.”</p>\n<p><strong>Watch:</strong> Volvo Trucks – The new Volvo FMX - Push the limits of productivity</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/CUH0mHEAU0o\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"p1\">The donation of the vehicles also includes a two-year Blue service contract.</p>\n<p>Many of SOS NPO’s project sites are located close to the Volvo Trucks branch in Cape Town, which makes it ideal for the team to provide support when needed.</p>\n<p class=\"p5\"><span class=\"s1\">“The news of the donation was the best we could wish for,” said Shelley Humphreys, executive director of SOS NPO. </span></p>\n<p class=\"p5\"><span class=\"s1\">“We value our partnership with Volvo Trucks and the Water on Wheels project is truly an example to inspire others.”</span></p>\n<p><strong>Now Read:</strong> <a href=\"https://roadtransport.news/new-volvo-fh-arrives-in-sa/\">New Volvo FH Arrives in SA</a></p>",
            "image": "https://roadtransport.news/media/posts/33/Volvo-Trucks.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-03-24T16:25:48+02:00",
            "date_modified": "2021-03-24T17:04:45+02:00"
        },
        {
            "id": "https://roadtransport.news/motus-isuzu-supports-farmers/",
            "url": "https://roadtransport.news/motus-isuzu-supports-farmers/",
            "title": "Motus Isuzu Supports Farmers",
            "summary": "The drought in South Africa has threatened the livelihood of many farmers but Motus Isuzu, in partnership with Isuzu South Africa and various farming assistance programmes, are working together to&hellip;",
            "content_html": "<p><strong>The drought in South Africa has threatened the livelihood of many farmers but Motus Isuzu, in partnership with Isuzu South Africa and various farming assistance programmes, are working together to ease this burden.</strong></p>\n<p><span style=\"font-weight: 400;\">Motus Isuzu Franchise managing director, Le Roux Roux, is well acquainted with the plight of the agricultural sector and believes that if farmers cannot produce, the country will be in trouble.</span></p>\n<p><span style=\"font-weight: 400;\">“The farmers are in desperate need. They have no money for food or to even send their children to school,” he says.</span></p>\n<p><span style=\"font-weight: 400;\">“While Mpumalanga and the Free State received good rain and farmers expected a good harvest, several farmers in northern Limpopo had to slaughter their animals because of the drought. </span></p>\n<p><span style=\"font-weight: 400;\">“The situation in the Northern and Eastern Cape provinces is equally dire,” adds Roux.</span></p>\n<p><span style=\"font-weight: 400;\">Isuzu SA donated three brand-new FVZ 1400 trucks to this initiative and Motus SA have provided the drivers and the fuel for all these trips. </span></p>\n<p><span style=\"font-weight: 400;\">Since November, the trucks have been doing trips on an almost weekly basis, collecting feed in areas that have had good rainfall and transporting it across the country to the areas in need, often covering vast distances.</span></p>\n<p><span style=\"font-weight: 400;\">Organisations such as Farmers Assist and Voer ‘n Boer handle the donations of feed and identify the areas in need and Motus Isuzu ensure that these large loads are delivered where they are most needed.</span></p>\n<p><span style=\"font-weight: 400;\">To date the three trucks have collected and distributed feed in many areas across the country, including Merweville, Vanwyksvlei, Somerset East, Upington and Pofadder.</span></p>\n<p><span style=\"font-weight: 400;\">“The investment in this project is substantial but it is worth it when you see the look of relief on the farmers' faces.”</span></p>\n<p><span style=\"font-weight: 400;\">“The effect that these deliveries have on the farmers is enormous and often means respite for their staff and the entire community,” said Roux.</span></p>\n<p><span style=\"font-weight: 400;\">The feed delivery initiative involves staff at all of the Motus Isuzu dealerships.  </span></p>\n<p><span style=\"font-weight: 400;\">Staff members from the closest dealership are our contact with the farmer and are present during collection or delivery of feed.</span></p>\n<p><span style=\"font-weight: 400;\">“We are trying to survive the worst drought ever. There’s no more natural vegetation left on the farm, we are dependent on these fodder donations. </span></p>\n<p><span style=\"font-weight: 400;\">“The feed is expensive, and due to our remote location, the delivery costs are extremely high; these donations that we are receiving are worth gold,” says Charles Muller, who has been a farmer in Merweville for the past 46 years.</span></p>\n<p><span style=\"font-weight: 400;\">“I am proud to be part of this initiative. As we drive across the country, cars flash their lights to show that they appreciate what we are doing to help the farmers. </span></p>\n<p><span style=\"font-weight: 400;\">“I think that we are setting a great example for the rest of South Africa, showing what can be achieved if we work together,” states David Xaba, truck driver from Motus Isuzu Isando.</span></p>\n<p><span style=\"font-weight: 400;\">Gishma Johnson, Isuzu SA Corporate Communications Manager said that one of the company’s corporate social responsibility objectives is to help communities in crisis. </span></p>\n<p><span style=\"font-weight: 400;\">“Finding the right partners to get the job done is so important and demonstrated just how much can be accomplished when you work together. </span></p>\n<p><span style=\"font-weight: 400;\">When Farmers Assist SA approached Isuzu for assistance earlier this year, we reached out to our dealer network to garner support and are very pleased that Motus Isuzu Isando stepped up to this.”</span></p>\n<p><span style=\"font-weight: 400;\">Motus Isuzu has four dealerships located in Isando, Vereeniging, Kimberley and Bloemfontein. </span></p>\n<p><span style=\"font-weight: 400;\">These dealerships are located near the main arteries of South Africa, including the N1, N12 and N3 and allows Motus Isuzu to best service their customers travelling these routes.</span></p>\n<p><span style=\"font-weight: 400;\">“The Bloemfontein and Kimberley dealerships are well situated near the farming communities and service a large geographical area from their central location.”</span></p>\n<p><span style=\"font-weight: 400;\">“Motus Isuzu are in the process of setting up a new dealership in the North of Pretoria, on Sefako Makgatho Drive, which will allow the group to better service their customers in this area as well as those travelling north on the N1,” said Roux.</span></p>\n<p><span style=\"font-weight: 400;\">“Motus Isuzu really sees this as a way of giving back to the farmers, apart from being great supporters of the Isuzu brand, the South African farming community are the back-bone of our country,” concluded Roux.</span></p>\n<p><span style=\"font-weight: 400;\">From a product perspective, the next few months are exciting times for Isuzu with the arrival of the new M-UX later this year, while the new D-Max bakkie, which will be built in Port Elizabeth, will go on sale early in 2022.</span></p>\n<p><strong>Now Read:</strong> <a href=\"https://roadtransport.news/commercial-vehicle-sales-plummet-189/\">Isuzu Maintains Medium-duty Dominance</a></p>",
            "image": "https://roadtransport.news/media/posts/32/Screenshot-2020-10-08-at-12.53.45.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Press Release",
                   "OEM&#x27;s"
            ],
            "date_published": "2021-03-20T10:33:00+02:00",
            "date_modified": "2021-03-20T10:39:28+02:00"
        }
    ]
}
