{
    "version": "https://jsonfeed.org/version/1",
    "title": "Road Transport News",
    "description": "",
    "home_page_url": "https://roadtransport.news",
    "feed_url": "https://roadtransport.news/feed.json",
    "user_comment": "",
    "author": {
        "name": "Tristan Wiggill"
    },
    "items": [
        {
            "id": "https://roadtransport.news/n4-upgrade-to-be-completed-in-july/",
            "url": "https://roadtransport.news/n4-upgrade-to-be-completed-in-july/",
            "title": "N4 Upgrade To Be Completed In July",
            "summary": "The recent rains have wreaked havoc on many of the country’s roads causing millions of rands in damage to road infrastructure. It is noted that poorly maintained roads impact negatively&hellip;",
            "content_html": "<p><strong>The recent rains have wreaked havoc on many of the country’s roads causing millions of rands in damage to road infrastructure. </strong><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">It is noted that poorly maintained roads impact negatively on communities and the country as a whole.</span></p>\n<p><span style=\"font-weight: 400;\">This highlights the importance of regular maintenance and upgrades which contribute towards keeping the wheels of the economy turning.</span></p>\n<p><span style=\"font-weight: 400;\">Bakwena Platinum Corridor Concessionaire (Pty) Ltd (Bakwena) says it places great importance on their road users’ experience of the routes it manages.</span></p>\n<p><span style=\"font-weight: 400;\">“Maintenance of road infrastructure assets and sharing updates on the work we are currently engaged in keeps road users informed and prepared,” says Bakwena’s Commercial Manager, Solomon Kganyago.</span></p>\n<p><span style=\"font-weight: 400;\">“Bakwena has an ongoing Routine Route Maintenance programme which includes grass cutting, vegetation control, stormwater cleaning, fence/guardrail/signage repairs and pavement defect restoration,” he explains.</span></p>\n<p><span style=\"font-weight: 400;\">“Our engineers regularly inspect the route to proactively carry out repairs/construction works to maintain the highest standards,” Kganyago adds.</span></p>\n<p><strong>Watch: </strong>Recent rains in Mpumalanga claim lives, damage infrastructure</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/uyoOH38tqUM\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><span style=\"font-weight: 400;\">The current N4 upgrade includes the addition of a 32km second carriageway on the N4 between the M17 and R512 (Brits interchange).  </span></p>\n<p><span style=\"font-weight: 400;\">This is a three-year contract which commenced in March 2018. Kganyago says the N4 upgrade is on track and the expected completion date is July 2021.</span></p>\n<p><span style=\"font-weight: 400;\">Further construction works taking place during 2021 include the rehabilitation of the N4 east between Ga-Rankuwa interchange and Doornpoort with an expected commencement date of July 2021.</span></p>\n<p><span style=\"font-weight: 400;\">“These upgrades will improve overall safety and convenience on the route as well as enhance motorists driving experience.” </span></p>\n<p><span style=\"font-weight: 400;\">“We would like to thank motorists for their patience while we complete these upgrades which are necessary to ensure the N1N4 route meets the highest international standards for motorists,” concludes Kganyago.</span></p>\n<p><br><br></p>",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "National Roads"
            ],
            "date_published": "2021-02-11T14:02:16+02:00",
            "date_modified": "2021-02-11T14:18:17+02:00"
        },
        {
            "id": "https://roadtransport.news/insurance-and-driver-training-intertwined/",
            "url": "https://roadtransport.news/insurance-and-driver-training-intertwined/",
            "title": "Insurance and driver training intertwined",
            "summary": "For many drivers the prospect of a lower insurance premium might be very appealing, especially as many households recover from the economic difficulty that resulted from lockdown. One way in&hellip;",
            "content_html": "<p><strong>For many drivers the prospect of a lower insurance premium might be very appealing, especially as many households recover from the economic difficulty that resulted from lockdown. </strong></p>\n<p>One way in which to do this, is through driver training.</p>\n<p>The managing director of MasterDrive, Eugene Herbert, recommends that all drivers contact their insurance providers about their driver training policies.</p>\n<p>“As driver training can drastically reduce your chances of being involved in a crash, many insurers encourage clients to undertake driver training and reduce monthly premiums in return.\"</p>\n<p>\"Drivers win with a saving on insurance costs and insurers benefit by avoiding the considerably larger costs that come with a crash.\"</p>\n<p>“These discounts can take various forms and percentages depending on the insurer. It is possible that some insurers offer discounts to certain groups, such as those falling into particular age groups, as they have a higher risk of crashes.\"</p>\n<p>\"Whatever the case is with your insurer, it is worthwhile finding out what value the insurer places on a driving course and how this can benefit you financially.”</p>\n<p><strong>Watch: </strong>15 Defensive Driving Secrets That Can Save Your Life</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/UnqOmbR2qNs\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Some insurers do not offer discounted premiums in exchange for driver training but this does not mean that there is no benefit for drivers.</p>\n<p>“Besides the general advantages of driver training, your chance of crashing is drastically reduced, meaning you also get to avoid costly excess payments if you are in an accident.</p>\n<p>“Excess can easily be equal to a good portion of your salary or savings, making even the smallest of crashes a costly endeavour.\"</p>\n<p>\"This is not to mention the costs that come from damages to other cars or property and medical expenses associated with accidents.”</p>\n<p>For business owners, the savings could be massive. “Companies are often offered the same benefits that the individual driver is.</p>\n<p>\"If driver training becomes part of company policy, the savings extend past a monthly discount but will also result in a reduction in fleet costs, damage to your public image and costly downtime.</p>\n<p>“Even companies that are self-insured will find a welcome relief from the demands on their insurance budget.\"</p>\n<p>\"When viewed from this perspective, driver training should be seen as something that is as important as maintenance or insurance itself.”</p>\n<p>Whatever options are available to you, there are benefits.</p>\n<p>“Insurance and driver training should be viewed as a whole. One without the other can result in additional and unnecessary expenses,” says Herbert.</p>",
            "image": "https://roadtransport.news/media/posts/17/driver-training.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Driver Training"
            ],
            "date_published": "2021-02-11T11:36:08+02:00",
            "date_modified": "2021-02-11T11:51:46+02:00"
        },
        {
            "id": "https://roadtransport.news/advertise-on-road-transport-news/",
            "url": "https://roadtransport.news/advertise-on-road-transport-news/",
            "title": "Advertise on Road Transport News",
            "summary": "A number of advertising opportunities are available, including website banners, sponsorships and advertorials. Use the website to reach a highly targeted group of readers and decision makers interested in road&hellip;",
            "content_html": "<p>A number of advertising opportunities are available, including website banners, sponsorships and advertorials. </p>\n<p>Use the website to reach a highly targeted group of readers and decision makers interested in road transport, logistics and trucking in South Africa.</p>\n<p>Please <a href=\"https://roadtransport.news/contact/\">contact us</a> for advertising rates and options.</p>",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
            ],
            "date_published": "2021-02-10T10:14:58+02:00",
            "date_modified": "2021-02-10T10:14:58+02:00"
        },
        {
            "id": "https://roadtransport.news/stop-aarto-now-road-freight-association/",
            "url": "https://roadtransport.news/stop-aarto-now-road-freight-association/",
            "title": "Stop AARTO Now - Road Freight Association",
            "summary": "The Road Freight Association (RFA) is shocked and deeply concerned about the recent suspension of the Road Traffic Infringement Agency’s Chief Executive Officer, Japh Chuwe, amidst allegations of “serious maladministration”&hellip;",
            "content_html": "<p><strong><a href=\"http://rfa.co.za/RFA/index.php/en/\" target=\"_blank\" rel=\"noopener noreferrer\">The Road Freight Association </a>(RFA) is shocked and deeply concerned about the recent suspension of the Road Traffic Infringement Agency’s Chief Executive Officer, Japh Chuwe, amidst allegations of “serious maladministration” by the Auditor-General. </strong></p>\n<p>This has a severe impact on the implementation of the highly controversial <a href=\"http://www.rtia.co.za/ruploads/administrative_adjudication_of_road_traffic_offences_act_1998-661.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Administrative Adjudication of Road Traffic Offences Act </a>(AARTO), which is scheduled to be implemented in July this year.<br><br>Whilst we welcome the uncovering of corruption, it would be irresponsible and reckless for Government to proceed with the implementation of AARTO.</p>\n<p>The RFA has over the years expressed concern and uneasiness about AARTO and its susceptibility to fraud, corruption, and money laundering.</p>\n<p>The RTIA’s latest announcement is confirmation of our worst fears. <br><br>Once AARTO is implemented, the <a href=\"http://www.rtia.co.za/\" target=\"_blank\" rel=\"noopener noreferrer\">RTIA</a> will be handling Billions of Rand. How can we now trust the entity – especially when the dishonesty and corruption is allegedly at the highest level in the Agency?</p>\n<p>We already face huge corruption, extortion and intimidation at the hands of traffic police on a daily basis and this latest development has highlighted how rampant dishonesty is in the public service – especially in the traffic law enforcement and management structures.</p>\n<p>These allegations have undermined what little faith we had in RTIA. If the system is implemented, we envisage theft on a grand scale. </p>\n<p><strong>Watch:</strong> <span class=\"style-scope yt-formatted-string\" dir=\"auto\">The latest draft of AARTO regulations has been gazetted by the Transport Department.</span></p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/cm_z8u75dJc\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The RFA once again proposes that AARTO be shelved. The continuously amended system is all about generating revenue and not at all about road safety, which was what the system was originally about.</p>\n<p>Huge administrative resources will be required to implement and sustain an antiquated and cumbersome system, putting additional burdens on already-overburdened government authorities and the private sector.<br><br>The <a href=\"https://www.rtmc.co.za/\" target=\"_blank\" rel=\"noopener noreferrer\">Road Traffic Management Corporation </a>(RTMC) – another Agency of the Department of Transport – already costs motorists hundreds of millions of Rand per annum through the levy imposed on all <a href=\"http://www.enatis.com/\" target=\"_blank\" rel=\"noopener noreferrer\">eNatis </a>transactions.</p>\n<p>This was supposed to be a temporary measure to get the RTMC on its feet. Like all other levies,  this has become permanent with no added value to citizens.</p>\n<p>The RTMC needs to step up and do its job, that is, manage road traffic according to proper traffic management strategies with effective centralised road safety interventions and operational management.<br><br>The RFA believes that proper traffic management strategies which focus resources to address hazardous locations and other aspects of unsafe road behaviour would be far more effective in improving road safety – rather than the current cumbersome AARTO system being proposed.</p>",
            "image": "https://roadtransport.news/media/posts/15/RFA-slams-AARTO.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "AARTO"
            ],
            "date_published": "2021-02-09T12:56:59+02:00",
            "date_modified": "2021-02-10T22:46:01+02:00"
        },
        {
            "id": "https://roadtransport.news/more-mb-truck-models-get-fleetboard/",
            "url": "https://roadtransport.news/more-mb-truck-models-get-fleetboard/",
            "title": "More MB Truck Models Get Fleetboard ",
            "summary": "Fleetboard from Mercedes-Benz Trucks is now part of the package for the Actros and selected Arocs distribution models. Fleetboard has been offered on the Actros range since 2009 and is&hellip;",
            "content_html": "<p><strong><a href=\"https://www.fleetboard.info/#/\" target=\"_blank\" rel=\"noopener noreferrer\">Fleetboard</a> from Mercedes-Benz Trucks is now part of the package for the Actros and selected Arocs distribution models.</strong></p>\n<p>Fleetboard has been offered on the Actros range since 2009 and is today not only available as a serial standard on the selected Mercedes-Benz Trucks models, it is also available for other vehicle makes as well.<br><br>Efficiency is the sum of the details; Fleetboard is geared to take RoadEfficiency to the next level through its unique service offerings to ensure lower total cost, greater safety and maximised use for customers.</p>\n<p><strong>Watch:</strong> How does Fleetboard work?</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/Ph-3whc2rNE\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Available in South Africa for many years, the Fleetboard system has established itself as a leading telematics solution for Mercedes-Benz Truck customers.</p>\n<p><strong>Related: <span style=\"color: #e50303;\"><a href=\"https://roadtransport.news/telematics-eases-vaccine-rollout/\" style=\"color: #e50303;\">Telematics Eases Vaccine Rollout</a></span></strong><a href=\"https://roadtransport.news/telematics-eases-vaccine-rollout/\"></a></p>\n<p>Boasting multiple benefits such as performance analysis and reports for vehicles and drivers, mapping and trip records including accurate fuel consumption, service and maintenance management as well as expert training and analysis.<br><br><a href=\"https://www.mercedes-benz-trucks.com/en_ZA/home.html\" target=\"_blank\" rel=\"noopener noreferrer\">Mercedes-Benz Trucks Southern Africa</a> understands that managing a fleet can be stressful and hard to keep up with, and believes that this strategic decision will be beneficial to customers within the long-haul and distribution segment.</p>\n<p>Effective utilisation of the system within these industries means that the truck can go further for longer, contributing to added savings in the long-run.<br><br>This is a significant step for the brand that is set to substantially benefit fleet owners and their respective drivers, as they efficiently run their fleet across Southern Africa.</p>",
            "image": "https://roadtransport.news/media/posts/14/MB-Trucks-Fleetboard.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Telematics"
            ],
            "date_published": "2021-02-09T09:16:40+02:00",
            "date_modified": "2021-02-10T22:53:52+02:00"
        },
        {
            "id": "https://roadtransport.news/telematics-eases-vaccine-rollout/",
            "url": "https://roadtransport.news/telematics-eases-vaccine-rollout/",
            "title": "Telematics Eases Vaccine Rollout",
            "summary": "President Cyril Ramaphosa has described the rollout of the COVID-19 vaccine as “the largest and most complex logistical undertaking in SA’s history”. Acquiring the vaccine is only the start of&hellip;",
            "content_html": "<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">President Cyril Ramaphosa has described the rollout of the COVID-19 vaccine as “the largest and most complex logistical undertaking in SA’s history”. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">Acquiring the vaccine is only the start of SA achieving its target of group immunity – the vaccine still needs to be distributed safely. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">That means maintaining it at the right temperature throughout the transportation process, and tracking distribution trucks to ensure product integrity and avoid tampering or theft. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">“Not only are we transporting small glass vials to every corner of our country, we must also maintain these doses at below freezer temperatures the entire trip,\" says <a href=\"https://www.linkedin.com/in/justin-manson-b5019216/\" target=\"_blank\" rel=\"noopener noreferrer\">Justin Manson</a>, Sales Director at <a href=\"https://www.webfleet.com/en_gb/webfleet/\" target=\"_blank\" rel=\"noopener noreferrer\">Webfleet Solutions</a>.</span></span></p>\n<p><strong>Related: <span style=\"color: #e50303;\"><a href=\"https://roadtransport.news/serco-gets-frosty-with-sequence-logistics/\" style=\"color: #e50303;\">Serco Gets Frosty With Sequence Logistics</a></span></strong></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">“Government must work with fleet management companies to develop a network of real-time tracking systems that measure, record and transmit trip details to ensure vaccines are transported to even the most remote parts of the country as safely and efficiently as possible.”</span></span></p>\n<p><strong>Watch:</strong> What is asset tracking?</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/W8jnsoTewQw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">Tracking and monitoring systems form a vital part of the vaccine transportation process in SA. </span></span></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">They provide fleet managers with a real-time view of the distribution trucks, including the correct functioning of refrigerated trailers, vehicle maintenance requirements and usage, driving behaviour, and the ability to detect theft in time to take effective action.</span></span></p>\n<p><strong>Worth reading: <span style=\"color: #e50303;\"><a href=\"#INTERNAL_LINK#/post/null\" style=\"color: #e50303;\">How to get a cold chain edge</a></span></strong></p>\n<p class=\"paragraph\"><span class=\"normaltextrun\"><span lang=\"EN-GB\">“Solutions like Asset Tracking offer advanced capabilities for better control of the total vaccine transportation value chain for enhanced efficiency and safety, while significantly reducing human error,” adds Manson.</span></span></p>",
            "image": "https://roadtransport.news/media/posts/13/Vaccine-distribution-logistics.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Telematics"
            ],
            "date_published": "2021-02-09T08:59:18+02:00",
            "date_modified": "2021-02-10T22:51:25+02:00"
        },
        {
            "id": "https://roadtransport.news/how-to-get-a-cold-chain-edge/",
            "url": "https://roadtransport.news/how-to-get-a-cold-chain-edge/",
            "title": "How To Get A Cold Chain Edge ",
            "summary": "Temperature and humidity monitoring are essential, particularly when it comes to the storage and transport of temperature-sensitive goods. In order to maintain the integrity of the cold chain from manufacturing&hellip;",
            "content_html": "<p><strong>Temperature and humidity monitoring are essential, particularly when it comes to the storage and transport of temperature-sensitive goods.</strong></p>\n<p>In order to maintain the integrity of the cold chain from manufacturing to distribution and retail or application of these items; real-time monitoring of temperature and humidity levels has become critical.</p>\n<p>Here, businesses should look to cloud-based monitoring technology to improve efficiencies, reduce costs and prevent unnecessary loss, essentially providing a competitive differentiator through the ability to accurately manage the cold chain.</p>\n<p><strong>Watch:</strong> The importance of the cold chain in distribution</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/Bk2j6qDwbh4\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><span style=\"color: #e50303;\"><strong>Challenging conditions in cold chain management</strong></span></p>\n<p>With the imminent rollout of Covid-19 vaccines, temperature and humidity monitoring have been the subject of much public attention.</p>\n<p>This is because the vaccines have to be stored and transported under stringent temperature conditions. Maintaining the necessary temperature conditions requires two things: cooling infrastructure across the entire logistics chain, and electricity to run the cooling equipment.</p>\n<p><strong>Related:</strong> <a href=\"https://roadtransport.news/telematics-eases-vaccine-rollout/\">Telematics Eases Vaccine Rollout</a></p>\n<p>Both of these factors can be challenging to uphold in South Africa, more so given the unreliability of the national power supply, which makes temperature monitoring even more important than ever.</p>\n<p>Furthermore, when the cold chain is broken temperature-sensitive perishable foods are degraded in terms of quality, shorter shelf life and in extreme cases, adverse health-related reactions for the people who consume such products.</p>\n<p>In terms of medicine - particularly vaccines - the impact of a broken cold chain can be even worse, as medication loses its efficacy and can even cause harm if administered.</p>\n<p><span style=\"color: #e50303;\"><strong>Technological advancements in temperature monitoring</strong></span></p>\n<p>Cloud technology has greatly increased the efficiency of temperature monitoring systems and temperature probes can now transmit their readings automatically in real-time to a control unit which then communicates with a cloud-based platform and secure database.</p>\n<p>This automatic monitoring eliminates the need for human intervention and manual temperature recording, which further facilitates Covid-19 physical distancing requirements.</p>\n<p><span style=\"color: #e50303;\"><strong>Smart stock protection</strong></span></p>\n<p>Automated monitoring through a cloud-based platform makes it possible to raise alerts electronically via SMS or email notification, should the temperature fluctuate outside of the permissible range.</p>\n<p>Such an alert system allows the organisation to be proactive when dealing with power outages or cooling equipment failures so that corrective action can be taken before damage is done.</p>\n<p>With such a monitoring system, the value to business lies in the data.</p>\n<p>In addition to providing actionable alerts, the system also provides a data trail of temperature readings that is fully secure, auditable and free from human error.</p>\n<p>This means that compliance reporting for the various controlling authorities can be automated, and it becomes much easier to protect stock that is often worth millions of Rands without relying on manual monitoring and reporting. </p>\n<p><span style=\"color: #e50303;\"><strong>Careful consideration</strong></span></p>\n<p>When choosing a temperature and humidity monitoring system, local businesses have many factors to consider.</p>\n<p>Given the instability of electricity supply, it’s important to look for a system that provides accuracy.</p>\n<p>It’s also important to examine inherent system redundancy, which needs to provide a 99.9% uptime.</p>\n<p>Additionally, the chosen system needs to be recognised by the relevant accreditation bodies according to local and global standards.</p>\n<p>Just as important as credentials are, so is the service and support provided by the supplier, so look for references from large blue-chip clients in the medical or food sectors.</p>\n<p>Lastly, ease of configuration, use and operation must be considered and should all be capable of remote management.</p>\n<p>While the market offers a lot of choice in temperature monitoring systems, it is critical not to choose based on the price tag.</p>\n<p>Instead, organisations must consider the cost of losing stock, and the impact on their bottom line if their cold chain is compromised.</p>\n<p>This will make it clear that the right cloud-based temperature and humidity monitoring system is a tool necessary for a competitive edge, and not simply another business operating expense.</p>",
            "image": "https://roadtransport.news/media/posts/12/Cold-chain-logistics.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "Logistics"
            ],
            "date_published": "2021-02-08T08:52:16+02:00",
            "date_modified": "2021-02-10T22:56:50+02:00"
        },
        {
            "id": "https://roadtransport.news/ford-trucks-adds-product-variants/",
            "url": "https://roadtransport.news/ford-trucks-adds-product-variants/",
            "title": "Ford Trucks Adds Product Variants",
            "summary": "Ford Trucks is kicking off 2021 with two new product variants, plus updated services and technologies throughout its current product range, launched in 44 countries. The Ford F-MAX family, which&hellip;",
            "content_html": "<p><strong>Ford Trucks is kicking off 2021 with two new product variants, plus updated services and technologies throughout its current product range, launched in 44 countries.</strong></p>\n<p dir=\"ltr\">The Ford F-MAX family, which now includes two new variants, F-MAX Blackline and F-MAX L, including new specifications and features, is bringing connected mobility technologies to Ford Trucks customers.</p>\n<p dir=\"ltr\">The company is introducing remote-control features with its ConnecTruck technology, offering more convenience and greater efficiency.</p>\n<p dir=\"ltr\">\"As an innovative brand that listens to our customers’ needs, we focus our R&amp;D efforts on bringing next-generation technologies to the market,” says Serhan Turfan, Vice President at Ford Trucks.  </p>\n<p dir=\"ltr\">“We believe we can add the most value for our customers by lowering their total cost of ownership. With each new product we develop, our goal is to help our customers manage their business more profitably.”</p>\n<p dir=\"ltr\">“We are proud to introduce a new range of products and technologies to our customers all over the world. We will continue to deliver more efficiency, even better performance and cutting-edge technologies for our customers.’</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://roadtransport.news/media/posts/11/Ford-Trucks.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-xs.jpg 300w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-sm.jpg 480w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-md.jpg 768w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-lg.jpg 1024w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-xl.jpg 1360w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-2xl.jpg 1600w\"  alt=\"Ford Trucks\" width=\"800\" height=\"534\"></figure>\n<p dir=\"ltr\"><span style=\"color: #e50303;\"><strong>F-MAX Blackline will be produced in a limited edition</strong></span></p>\n<p dir=\"ltr\">The Ford F-MAX Blackline, an exclusive variant of the international award-winning F-MAX, will be produced as a limited edition. </p>\n<p dir=\"ltr\">Each vehicle will feature a special serial number and the Blackline Series emblem on its door.</p>\n<p dir=\"ltr\">Only 250 units will be produced for this limited edition, which will be available in a special ‘moondust’ silver exterior colour, with blue and black stripes that accentuate the vehicle’s style, as well as black LED headlamps, black wheels, and black mirror caps. </p>\n<p dir=\"ltr\">The F-MAX Blackline features a high-end interior design, with seats trimmed in black with blue stripes and stitch details, in addition to blue highlights and stitch details on the leather steering wheel and spacious overhead storage areas. </p>\n<p dir=\"ltr\">The F-MAX Blackline's front console as well as bed and under-bed storage areas also feature distinctive black design details.</p>\n<p dir=\"ltr\">ConnecTruck offers new features that make life easier for drivers and fleet managers</p>\n<p dir=\"ltr\">Ford Trucks is transforming its vehicles into data-driven, connected mobility products, equipped with next-generation technologies that benefit customers. </p>\n<p dir=\"ltr\">The new technologies include features such as GPS-based cruise control and multimedia system that make life easier for drivers and fleet managers. </p>\n<p dir=\"ltr\">The new remote-control features also enable users of the My Ford Trucks app to control their vehicles remotely, giving drivers an even higher level of comfort.</p>\n<p dir=\"ltr\">Meanwhile, the online portal <a href=\"http://www.connectruckglobal.com/\">ConnecTruckGlobal.com</a> has been expanded to include new features, especially for fleets. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://roadtransport.news/media/posts/11/FT_Blackline-3.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/11/responsive/FT_Blackline-3-xs.jpg 300w ,https://roadtransport.news/media/posts/11/responsive/FT_Blackline-3-sm.jpg 480w ,https://roadtransport.news/media/posts/11/responsive/FT_Blackline-3-md.jpg 768w ,https://roadtransport.news/media/posts/11/responsive/FT_Blackline-3-lg.jpg 1024w ,https://roadtransport.news/media/posts/11/responsive/FT_Blackline-3-xl.jpg 1360w ,https://roadtransport.news/media/posts/11/responsive/FT_Blackline-3-2xl.jpg 1600w\"  alt=\"Ford Trucks FT Blackline\" width=\"800\" height=\"537\"></figure>\n<p dir=\"ltr\">Now, it allows fleet managers to track their vehicles on a desktop computer or tablet, with bonus features in addition to the mobile app. </p>\n<p dir=\"ltr\">The new features give drivers and fleet managers access to historical vehicle data and route information, all within a few clicks.</p>\n<p dir=\"ltr\">New F-MAX L, featuring a longer wheelbase and up to 5,000 km range on a single tank </p>\n<p dir=\"ltr\">Ford Trucks aims to exceed its customers’ expectations with the new F-MAX L, featuring a longer wheelbase and a range of up to 5,000 kilometres on a single tank. </p>\n<p dir=\"ltr\">The F-MAX L’s 1350-litre fuel tank is 300 litres larger than the standard F-MAX tank, offering significant transportation advantages in combination with the truck’s expanded 3750 mm wheelbase. </p>\n<p dir=\"ltr\">Customers can also choose a 1050-litre tank option by simply selecting a longer wheelbase.</p>\n<p dir=\"ltr\">”Eco+ Mode” is now standard in all F-MAX variants, reducing fuel consumption by up to 5% </p>\n<p dir=\"ltr\">As fuel consumption and total cost of ownership are the most important criteria in the heavy commercial vehicle sector, Ford Trucks introduced “Eco+ Mode”, allowing drivers to increase fuel efficiency by up to 5%. </p>\n<p dir=\"ltr\">Starting in 2021, Eco+ Mode will be a standard feature in all F-MAX variants.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://roadtransport.news/media/posts/11/Ford-Trucks-FT-Interior.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Interior-xs.jpg 300w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Interior-sm.jpg 480w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Interior-md.jpg 768w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Interior-lg.jpg 1024w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Interior-xl.jpg 1360w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Interior-2xl.jpg 1600w\"  alt=\"Ford Trucks FT lIne Interior\" width=\"800\" height=\"527\"></figure>\n<p dir=\"ltr\">When Eco+ Mode is activated, the system takes actions to automatically reduce fuel consumption. The Max Cruise feature sets the most efficient vehicle speed based on road conditions and topography identified using GPS data. </p>\n<p dir=\"ltr\">Eco Roll is also activated, allowing for optimal acceleration when driving downhill, so that the truck covers the maximum distance with minimum fuel consumption.</p>\n<p dir=\"ltr\">When Eco+ Mode is switched on, engine power is limited to 450 PS and vehicle speed to 85 kilometres per hour. </p>\n<p dir=\"ltr\">If the vehicle idles for longer than five minutes, the engine automatically shuts off to save fuel. This is especially beneficial if the vehicle is left running while waiting at customs or loading.</p>\n<p dir=\"ltr\">Finally, the high-performance kickdown feature is deactivated in Eco+ Mode to conserve fuel. Fleet owners can control and monitor all these features remotely using the My Ford Trucks mobile app.</p>\n<p dir=\"ltr\">Road Trucks series are now even more comfortable with ZF EcoTronic 9-speed automated transmission</p>\n<p dir=\"ltr\">Ford Trucks engineers analyzed the expectations and behaviors of European customers, and offered new 9-speed automated transmission in road series. </p>\n<p dir=\"ltr\">It will provide drivers significant driving comfort, especially in urban areas with heavy traffic, while also reducing fuel consumption and, consequently, the total cost of ownership. </p>\n<p dir=\"ltr\">The ZF EcoTronic 9-speed automated transmission offers better driving comfort in 330PS light tipper and light road trucks. </p>\n<p dir=\"ltr\">And, by eliminating gear shifting, it helps utility vehicles such as fire trucks to perform even faster during situations where every second counts.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://roadtransport.news/media/posts/11/Ford-Trucks-FT-Max.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Max-xs.jpg 300w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Max-sm.jpg 480w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Max-md.jpg 768w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Max-lg.jpg 1024w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Max-xl.jpg 1360w ,https://roadtransport.news/media/posts/11/responsive/Ford-Trucks-FT-Max-2xl.jpg 1600w\"  alt=\"Ford Trucks FT-Max\" width=\"800\" height=\"570\"></figure>\n<p dir=\"ltr\"><span style=\"color: #e50303;\"><strong>Rear Steerable Axle, improved manoeuvrability and turning radius</strong></span></p>\n<p dir=\"ltr\">The engineers at Ford Trucks understand the importance of manoeuvrability and a small turning radius during urban use and they developed a new rear steerable axle to improve manoeuvrability in 9LT 6X2 vehicles. </p>\n<p dir=\"ltr\">The new system improves the turning radius by 9%, offering a more comfortable driving experience, especially in confined urban settings. </p>\n<p dir=\"ltr\"><strong>Watch:</strong> Ford F-Max 2021 Tractor Truck - Interior, Exterior, Walkaround</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"800\" height=\"449\" src=\"https://www.youtube.com/embed/ulHgudL97i4\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Ford Super Duty Ford Blue Oval Ford Model TT Ford F-150 XLT Lariat Ford F-Series Super Duty model line Ford full-size truck platform Ford Expedition Ford Cargo Ford Racing</p>\n<p dir=\"ltr\"> </p>\n<p><br><br></p>\n<p dir=\"ltr\">  </p>",
            "image": "https://roadtransport.news/media/posts/11/Ford-Trucks-Blackline.jpg",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
                   "International Truck Models"
            ],
            "date_published": "2021-02-06T12:51:37+02:00",
            "date_modified": "2021-02-10T22:59:48+02:00"
        },
        {
            "id": "https://roadtransport.news/contact/",
            "url": "https://roadtransport.news/contact/",
            "title": "Contact Road Transport News",
            "summary": "Physical address: 59 Kelvin Road, Raumaraispark, Johannesburg, 2090 Tel: 073 972 5086 Email: tristan@roadtransport.news Opening hours: Monday to Friday, 07:00am to 6:00pm Don't forget to follow and engage with Road&hellip;",
            "content_html": "<p><strong>Physical address:</strong> 59 Kelvin Road, Raumaraispark, Johannesburg, 2090</p>\n<p><strong>Tel:</strong> 073 972 5086</p>\n<p><strong>Email:</strong> <a href=\"mailto:tristan@roadtransport.news\">tristan@roadtransport.news</a></p>\n<p><strong>Opening hours:</strong> Monday to Friday, 07:00am to 6:00pm</p>\n<p>Don't forget to follow and engage with Road Transport News on <a href=\"https://www.facebook.com/RoadTransportNews\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook</a>, <a href=\"https://twitter.com/roadtransportza\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a> and <a href=\"https://www.linkedin.com/company/road-transport-news-za\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn</a>.</p>",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
            ],
            "date_published": "2021-02-05T15:58:49+02:00",
            "date_modified": "2021-02-10T10:10:52+02:00"
        },
        {
            "id": "https://roadtransport.news/about/",
            "url": "https://roadtransport.news/about/",
            "title": "About Road Transport News",
            "summary": "Road Transport News is the place to get news about the road transport industry in South Africa. The news website is updated regularly with stories about road transport, logistics, trucks&hellip;",
            "content_html": "<p>Road Transport News is the place to get news about the road transport industry in South Africa.</p>\n<p>The news website is updated regularly with stories about road transport, l<a href=\"https://roadtransport.news/tags/logistics/\">ogistics</a>, trucks and buses.</p>\n<p>The fast, secure and mobile friendly website reports on general developments and happenings within the road transport sector.</p>\n<p>We cover <a href=\"https://roadtransport.news/tags/launch/\">truck and bus launches</a> in South Africa as well as the industries that support trucking and logistics such as <a href=\"https://roadtransport.news/tags/tyres/\">tyres</a>, <a href=\"https://roadtransport.news/tags/trailers/\">trailers</a>, <a href=\"https://roadtransport.news/tags/telematics/\">telematics</a>, <a href=\"https://roadtransport.news/tags/batteries/\">batteries </a>and more.</p>\n<p>Other focus areas of news include:</p>\n<ul>\n<li><a href=\"https://roadtransport.news/tags/driver-training/\">Driver training</a></li>\n<li><a href=\"https://roadtransport.news/tags/national-roads/\">National Roads</a> and</li>\n<li><a href=\"https://roadtransport.news/tags/logistics/\"></a><a href=\"#INTERNAL_LINK#/tag/null\">Truck Sales</a></li>\n</ul>\n<p>We also publish opinion pieces by thought leaders in the road transport sector.</p>\n<p><a href=\"https://g.page/road-transport-news-za\" target=\"_blank\" rel=\"noopener noreferrer\">The business</a> is the brainchild of <a href=\"https://www.linkedin.com/in/tristanwiggill/\" target=\"_blank\" rel=\"noopener noreferrer\">Tristan Wiggill</a>, a highly experienced editor, journalist and publisher who has worked in the transport and logistics media industry since 2013. </p>\n<p>Please free to send us any related industry news and opinion to <a href=\"mailto:tristan@roadtransport.news\">tristan@roadtransport.news</a> for possible publication.</p>\n<p>We also have a number of great <a href=\"https://roadtransport.news/advertise-on-road-transport-news/\">advertising opportunities</a> available to you! </p>",
            "author": {
                "name": "Tristan Wiggill"
            },
            "tags": [
            ],
            "date_published": "2021-02-05T15:55:34+02:00",
            "date_modified": "2021-02-11T15:29:59+02:00"
        }
    ]
}
